asset-group/U-Fuzz/Zigbee/zigbee_decoder/Z-Stack 3.0.2/Components/hal/target/CC2538ZNP/iocc2538.h
/**************************************************************************************************
  Filename:       iocc2538.h
  Revised:        $Date: 2013-10-21 17:25:23 -0700 (Mon, 21 Oct 2013) $
  Revision:       $Revision: 35745 $

  Description:    Defines for sys ctrl, ADC, RNG, flash info page.


  Copyright 2011-2013 Texas Instruments Incorporated. All rights reserved.

  IMPORTANT: Your use of this Software is limited to those specific rights
  granted under the terms of a software license agreement between the user
  who downloaded the software, his/her employer (which must be your employer)
  and Texas Instruments Incorporated (the "License").  You may not use this
  Software unless you agree to abide by the terms of the License. The License
  limits your use, and you acknowledge, that the Software may not be modified,
  copied or distributed unless embedded on a Texas Instruments microcontroller
  or used solely and exclusively in conjunction with a Texas Instruments radio
  frequency transceiver, which is integrated into your product.  Other than for
  the foregoing purpose, you may not use, reproduce, copy, prepare derivative
  works of, modify, distribute, perform, display or sell this Software and/or
  its documentation for any purpose.

  YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE SOFTWARE AND DOCUMENTATION ARE
  PROVIDED “AS IS” WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,
  INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE,
  NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL
  TEXAS INSTRUMENTS OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT,
  NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER
  LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
  INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE
  OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT
  OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
  (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.

  Should you have any questions regarding your right to use this Software,
  contact Texas Instruments Incorporated at www.TI.com.
**************************************************************************************************/


#ifndef __IOCC2538_H__
#define __IOCC2538_H__


//*****************************************************************************
//
// The following are defines for the base address of the memories and
// peripherals on the top_s interface.
//
//*****************************************************************************

//*****************************************************************************
//
// The following are defines for the SYS_CTRL register offsets.
//
//*****************************************************************************

#include "hw_types.h"
#include "hw_sys_ctrl.h"
#include "hw_soc_adc.h"

/* FIFO Direct Access */
#define RXFIFO                              0x40088000
#define RXFIFO_SZ                           128
#define TXFIFO                              0x40088200
#define TXFIFO_SZ                           128
#define SRC_ADDR_TABLE                      0x40088400   
#define SRC_ADDR_TABLE_SZ                   96

#define CLOCK_CTRL                          HWREG(SYS_CTRL_CLOCK_CTRL)  
#define CLOCK_STA                           HWREG(SYS_CTRL_CLOCK_STA)      
#define RCGCGPT                             HWREG(SYS_CTRL_RCGCGPT)        
#define SCGCGPT                             HWREG(SYS_CTRL_SCGCGPT)        
#define DCGCGPT                             HWREG(SYS_CTRL_DCGCGPT)        
#define SRGPT                               HWREG(SYS_CTRL_SRGPT)          
#define RCGCSSI                             HWREG(SYS_CTRL_RCGCSSI)        
#define SCGCSSI                             HWREG(SYS_CTRL_SCGCSSI)        
#define DCGCSSI                             HWREG(SYS_CTRL_DCGCSSI)        
#define SRSSI                               HWREG(SYS_CTRL_SRSSI)          
#define RCGCUART                            HWREG(SYS_CTRL_RCGCUART)       
#define SCGCUART                            HWREG(SYS_CTRL_SCGCUART)       
#define DCGCUART                            HWREG(SYS_CTRL_DCGCUART)       
#define SRUART                              HWREG(SYS_CTRL_SRUART)         
#define RCGCI2C                             HWREG(SYS_CTRL_RCGCI2C)        
#define SCGCI2C                             HWREG(SYS_CTRL_SCGCI2C)        
#define DCGCI2C                             HWREG(SYS_CTRL_DCGCI2C)        
#define SRI2C                               HWREG(SYS_CTRL_SRI2C)  
#define PMCTL                               HWREG(SYS_CTRL_PMCTL)
#define ADCCON1                             HWREG(SOC_ADC_ADCCON1)           
#define ADCCON2                             HWREG(SOC_ADC_ADCCON2)        
#define ADCCON3                             HWREG(SOC_ADC_ADCCON3)           
#define ADCL                                HWREG(SOC_ADC_ADCL)         
#define ADCH                                HWREG(SOC_ADC_ADCH)              
#define RNDL                                HWREG(SOC_ADC_RNDL)              
#define RNDH                                HWREG(SOC_ADC_RNDH)              
#define OPAMPC                              HWREG(SOC_ADC_OPAMPC)            
#define OPAMS                               HWREG(SOC_ADC_OPAMPS)            
#define CMPCTL                              HWREG(SOC_ADC_CMPCTL)

/* Pointer to Start of Flash Information Page */
#define P_INFOPAGE                          HWREG(0x00280000) 
#define FLASH_INFO_PAGE_LOWER_32BIT         0x00280FF8
#define FLASH_INFO_PAGE_UPPER_32BIT         0x00280FFC
#define CHIPID_MASK                         0xFFFF0000
#define CHIPID ((*((const unsigned long *)(FLASH_INFO_PAGE_LOWER_32BIT))) & CHIPID_MASK) 

#endif // __IOCC2538_H__
